Repository: asv-soft/asv-avalonia
Catalog: src/Asv.Avalonia.Example/RS.*.resx
Languages: ru

# DialogControlsPageViewModel_Title
source: Dialogs
ru: Диалоги

# MapControlsPageViewModel_Title
source: Map Example
ru: Пример карты

# InfoBoxControlsPageViewModel_Title
source: InfoBox
ru: Всплывающие сообщение

# HistoricalControlsPageViewModel_Title
source: Historical fields
ru: Запоминающие поля

# ControlsGalleryPageViewModel_Title
source: Controls gallery
ru: Список элементов

# OpenControlsGalleryPageCommand_CommandInfo_Description
source: Command that open's controls gallery
ru: Команда, которая открывае галерею контролов

# OpenControlsGalleryPageCommand_CommandInfo_Name
source: Open controls gallery
ru: Открыть галерею контролов

# DialogControlsPageViewModel_OpenFilePrefab_Title
source: Open File
ru: Открыть файл

# DialogControlsPageViewModel_SaveFilePrefab_Title
source: Save File
ru: Сохранить файл

# DialogControlsPageViewModel_SelectFolderPrefab_Title
source: Open Folder
ru: Открыть папку

# DialogControlsPageViewModel_ObserveFolderPrefab_Title
source: Observe Folder
ru: Показать папку

# DialogControlsPageViewModel_YesOrNoPrefab_Message
source: Do you really want to exit?
ru: Вы действительно хотите выйти?

# DialogControlsPageViewModel_YesOrNoPrefab_Title
source: Warning
ru: Предупреждение

# DialogControlsPageViewModel_SavePrefab_Message
source: Save?
ru: Сохранить?

# DialogControlsPageViewModel_SavePrefab_Title
source: Saving
ru: Сохранение

# DialogControlsPageViewModel_HotKeyCapturePrefab_Title
source: Key Capture
ru: Захват сочетания клавиш

# DialogControlsPageViewModel_HotKeyCapturePrefab_Message
source: Press the key
ru: Нажмите клавишу

# DialogControlsPageViewModel_InputPrefab_Title
source: Input
ru: Ввод

# DialogControlsPageViewModel_InputPrefab_Message
source: Pass the data
ru: Введите данные

# HistoricalControlsPageView_Rules_One
source: One rule:
ru: Одно правило:

# HistoricalControlsPageView_Rules_Many
source: Many rules:
ru: Много правил:

# HistoricalControlsPageView_Description
source: Examples of historical properties with simple editing.
ru: Примеры простых запоминающих свойств.

# HistoricalControlsPageView_Rules_Description
source: Rules: non-empty; and second input additionally forbids ‘s’.
ru: Правила: непустое; и второй ввод дополнительно запрещает «s».

# InfoBoxControlsPageView_Description
source: Inline notification for app-wide messages. Examples below show basic usage, action button, and closable variants.
ru: Встроенное уведомление для сообщений, отображаемых по всему приложению. Примеры ниже показывают базовое использование, вариант с кнопкой действия и вариант с возможностью закрытия.

# DialogControlsPageView_System_Note
source: System dialogs are available on desktop platforms. Some options depend on OS capabilities.
ru: Системные диалоги доступны на настольных платформах. Некоторые параметры зависят от возможностей операционной системы.

# DialogControlsPageView_Custom_Title
source: Custom dialog prefabs
ru: Префабы кастомных диалогов

# DialogControlsPageView_Description
source: Examples of dialogs — windows for text input, option selection, action confirmation and so on.
ru: Примеры диалогов — окон для ввода текста, выбора параметров, подтверждения действий и так далее.

# DialogControlsPageView_System_Title
source: Prefabs of the system dialogs
ru: Префабы системных диалогов

# InfoBoxControlsPageView_Basic
source: Basic
ru: Обычный

# InfoBoxControlsPageView_Closable
source: Closable
ru: Закрываемый

# InfoBoxControlsPageView_Common_Message
source: Message
ru: Сообщение

# InfoBoxControlsPageView_Common_Severity
source: Severity
ru: Важность

# InfoBoxControlsPageView_Common_Title
source: Title
ru: Название

# InfoBoxControlsPageView_Examples
source: Examples
ru: Примеры

# InfoBoxControlsPageView_ActionButton
source: With action button
ru: С кнопкой действия

# InfoBoxControlsPageView_ActionButton_Title
source: Do action
ru: Делать что-то

# HistoricalControlsPageView_Validation
source: Validation
ru: С валидацией

# HistoricalControlsPageView_GeoPoint
source: GeoPoint:
ru: Геоточка:

# HistoricalControlsPageView_Toggle
source: Toggle:
ru: Переключатель:

# HistoricalControlsPageView_String
source: String (no validation):
ru: Строка (без валидации):

# HistoricalControlsPageView_Basic
source: Basic
ru: Базовые

# HistoricalControlsPageView_Unit
source: Speed:
ru: Скорость:

# InfoBoxControlsPageViewModel_Example_Message
source: Example InfoBox message
ru: Пример сообщения

# InfoBoxControlsPageViewModel_Example_Title
source: Example InfoBox title
ru: Пример названия

# DialogControlsPageView_OpenFilePrefab_Title
source: Open file
ru: Выбрать файл

# DialogControlsPageView_SaveFilePrefab_Title
source: Save file
ru: Сохранить файл

# DialogControlsPageView_SelectFolderPrefab_Title
source: Select folder
ru: Выбрать папку

# DialogControlsPageView_ObserveFolderPrefab_Title
source: Observe folder
ru: Просмотреть папку

# DialogControlsPageView_YesOrNoPrefab_Title
source: Open confirmation dialog
ru: Открыть диалог подтверждения

# DialogControlsPageView_InputPrefab_Title
source: Open input dialog
ru: Открыть диалог ввода

# DialogControlsPageView_HotKeyCapturePrefab_Title
source: Open key capture dialog
ru: Открыть диалог захвата

# DialogControlsPageView_SavePrefab_Title
source: Open saving dialog
ru: Открыть диалог сохранения

# DialogControlsPageViewModel_CancelResult
source: cancel
ru: отмена

# DialogControlsPageViewModel_HotKeyCapturePrefab_Result
source: Selected HotKey: {0}
ru: Выбранное сочетание клавиш: {0}

# DialogControlsPageViewModel_InputPrefab_Result
source: Input: {0}
ru: Ввод: {0}

# DialogControlsPageViewModel_SavePrefab_Result
source: Saved: {0}
ru: Сохранено: {0}

# DialogControlsPageViewModel_YesOrNoPrefab_Result
source: Yes/No: {0}
ru: Да/Нет: {0}

# DialogControlsPageViewModel_ObserveFolderPrefab_Result
source: Observed folder: {0}
ru: Открыта папка: {0}

# DialogControlsPageViewModel_SelectFolderPrefab_Result
source: Selected folder: {0}
ru: Выбрана папка: {0}

# DialogControlsPageViewModel_SaveFilePrefab_Result
source: Saved file: {0}
ru: Сохранен файл: {0}

# DialogControlsPageViewModel_OpenFilePrefab_Result
source: Opened file: {0}
ru: Открыт файл: {0}

# OpenControlsGalleryPageCommand_Action_Description
source: Open controls gallery
ru: Открыть галерею контролов

# OpenControlsGalleryPageCommand_Action_Title
source: Controls gallery
ru: Галерея контролов

# HistoricalControlsPageView_Enum
source: Enum:
ru: Перечисление:

# DialogControlsPageViewModel_GeoPointPrefab_Result
source: Selected GeoPoint: {0}
ru: Выбранная геоточка: {0}

# DialogControlsPageView_GeoPointPrefab_Title
source: Open geopoint dialog
ru: Открыть диалог выбора геоточки

# DialogControlsPageView_ContentDialog_Buttons
source: Primary / Secondary:
ru: Главная/вторичная:

# DialogControlsPageView_ContentDialog_Content
source: Content
ru: Контент

# DialogControlsPageView_ContentDialog_Title
source: Title
ru: Название

# DialogControlsPageView_ContentDialog_Header
source: Custom dialog
ru: Кастомный диалог

# DialogControlsPageView_ContentDialog_Description
source: You can create a new dialog from scratch. You can configure its content, the displayed buttons, their text, and whether they are enabled or not. Below you will find only a few customization options — all other parameters are configured programmatically.
ru: Вы можете создать новый диалог с нуля. Для этого доступна настройка содержимого (контента), отображаемых кнопок, их текста и возможности взаимодействия с ними. Ниже представлены лишь некоторые из пунктов кастомизации — остальные параметры задаются программно.

# DialogControlsPageView_Prefabs_Header
source: Ready dialog prefabs
ru: Готовые префабы диалогов

# DialogControlsPageView_Prefabs_Description
source: You can also use ready-made dialog prefabs that are suitable for most tasks, such as text input, selecting a geolocation point, choosing a file, and so on. Some parameters in them, such as the message or button availability, can also be customized. Prefabs are divided into two types: custom dialogs created manually for specific tasks, and system dialogs such as the file picker.
ru: Вы также можете использовать готовые префабы диалогов, которые подходят для большинства задач: ввод текста, выбор геоточки, файла и так далее. В них можно настраивать часть параметров, например сообщение или доступность кнопок. Готовые префабы делятся на два типа: кастомные диалоги, создаваемые вручную для специфических задач, а также системные диалоги, такие как файловый диалог.

# DialogControlsPageView_SelectFolderPrefab_Description
source: Allows the user to select a folder. • Input: dialog title and initial location. • Output: selected folder path.
ru: Позволяет выбрать папку. • Ввод: заголовок диалога и начальная локация. • Вывод: путь к выбранной папке.

# DialogControlsPageView_SaveFilePrefab_Description
source: Allows the user to save a file. • Input: title, default extension, type filter, and initial directory. • Output: selected file path.
ru: Позволяет сохранить файл. • Ввод: заголовок, расширение по умолчанию, фильтр типов и начальная папка. • Вывод: путь к сохранённому файлу.

# DialogControlsPageView_OpenFilePrefab_Description
source: Allows the user to open a file. • Input: title, type filter, and initial directory. • Output: selected file path.
ru: Позволяет открыть файл. • Ввод: заголовок, фильтр типов и начальная папка. • Вывод: путь к выбранному файлу.

# DialogControlsPageView_ObserveFolderPrefab_Description
source: Shows the contents of the selected folder. • Input: dialog title and default path. • Output: none.
ru: Показывает содержимое выбранной папки. • Ввод: заголовок и путь по умолчанию. • Вывод: нет.

# DialogControlsPageView_GeoPointPrefab_Description
source: Allows the user to select a point on the map. • Input: initial location. • Output: GeoPoint.
ru: Позволяет выбрать точку на карте. • Ввод: начальное местоположение. • Вывод: GeoPoint.

# DialogControlsPageView_HotKeyCapturePrefab_Description
source: Allows the user to choose a hotkey by pressing it. • Input: title, message, and default hotkey. • Output: selected hotkey.
ru: Позволяет выбрать сочетание клавиш, просто нажав его. • Ввод: заголовок, сообщение и текущая комбинация. • Вывод: выбранная горячая клавиша.

# DialogControlsPageView_InputPrefab_Description
source: Allows the user to enter text. • Input: dialog title and message. • Output: entered text value.
ru: Позволяет ввести текст. • Ввод: заголовок и сообщение. • Вывод: введённое значение.

# DialogControlsPageView_SavePrefab_Description
source: Used to confirm saving information. • Input: dialog title and message. • Output: true or false.
ru: Используется для подтверждения сохранения данных. • Ввод: заголовок и сообщение. • Вывод: true или false.

# DialogControlsPageView_YesOrNoPrefab_Description
source: Allows the user to agree or decline. • Input: dialog title and message. • Output: true or false.
ru: Позволяет согласиться или отказаться. • Ввод: заголовок и сообщение. • Вывод: true или false.

# DialogControlsPageViewModel_ContentDialog_Result
source: Custom dialog result: {0}
ru: Результат кастомного диалога: {0}

# DialogControlsPageViewModel_ObserveFolderPrefab_ResultShort
source: Directory opened!
ru: Директория открыта!

# DialogControlsPageViewModel_ContentDialog_Primary
source: Primary
ru: Основная

# DialogControlsPageViewModel_ContentDialog_Secondary
source: Secondary
ru: Вторичная

# DialogControlsPageViewModel_ContentDialog_Close
source: Close
ru: Закрыть

# DialogControlsPageView_InputPrefab_Placeholder
source: Some text...
ru: Какой-то текст...

# DialogControlsPageView_ContentDialog_ImageContent
source: Image
ru: Фото

# DialogControlsPageView_ContentDialog_TextContent
source: Text
ru: Текст

# DialogControlsPageView_ContentDialog_ImageContent_Select
source: Select photo...
ru: Выберите фото...

# DialogControlsPageView_ObserveFolderPrefab_PlaceHolder
source: Press the button...
ru: Нажмите кнопку...

# DialogControlsPageView_ContentDialog_Open
source: Open dialog
ru: Открыть диалог

# ResetGeoPointDialogResultCommand_CommandInfo_Name
source: Reset geopoint dialog
ru: Сбросить диалог геоточки

# ResetGeoPointDialogResultCommand_CommandInfo_Description
source: Reset the geopoint dialog result
ru: Сбросить результат диалога геоточки

# ShellLeftMenuExtenderExample_HomeItem_Header
source: Home page
ru: Домашняя страница
